'''
 Урок 2. Задание 3.
Пользователь вводит месяц в виде целого числа от 1 до 12.
Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
Напишите решения через list и через dict.
'''

# ввод числа
user_input = input("Введите месяц в виде целого числа от 1 до 12 >>>")

# проверка ввода
if not user_input.isdigit():
    print("Неверный формат ввода")
    exit()
user_input = int(user_input)

# решение через dict
dict_season = {1: "зима", 2: "зима", 3: "весна", 4: "весна", 5: "весна", 6: "лето", 7: "лето", 8: "лето", 9: "осень", 10: "осень", 11: "осень", 12: "зима12"}

print(dict_season.get(user_input))

# решение через list
list_season = ["зима", "зима", "весна", "весна", "весна", "лето", "лето", "лето","осень", "осень", "осень", "зима"]
print(list_season[user_input])


